ESI/hsSphere_rcf_qtr/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       true;

// Geometry. Definition of all surfaces. All surfaces are of class
// searchableSurface.
// Surfaces are used
// - to specify refinement for any mesh cell intersecting it
// - to specify refinement for any mesh cell inside/outside/near
// - to 'snap' the mesh boundary to the surface
geometry
{
/*     hedge{
        type triSurfaceMesh;
        file "HEDGE.obj";
    } */
/*     refineBox
    {
        type            searchableBox;
        min             (-0.183134 0 0);
        max             (1.0988 0.19774 0.19744);
    } */
    sphere
    {
        type            searchableSphere;
        origin          (0 0 0);
        radius          0.18;
    }


};

// Settings for the castellatedMesh generation.
castellatedMeshControls
{

   
    maxLocalCells 2000000;

    
    maxGlobalCells 20000000;

   
    minRefinementCells 100;

   
    maxLoadUnbalance 0.2;


    
    nCellsBetweenLevels 3;



    // Explicit feature edge refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies a level for any cell intersected by its edges.
    // This is a featureEdgeMesh, read from constant/triSurface for now.
    features
    (

    );



    // Surface based refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies two levels for every surface. The first is the minimum level,
    // every cell intersecting a surface gets refined up to the minimum level.
    // The second level is the maximum level. Cells that 'see' multiple
    // intersections where the intersections make an
    // angle > resolveFeatureAngle get refined up to the maximum level.

    refinementSurfaces
    {
        sphere{
            level (3 5);
            patchInfo{
                type wall;
            }
        }
    }

    // Resolve sharp angles
    resolveFeatureAngle 30;


    // Region-wise refinement
    // ~~~~~~~~~~~~~~~~~~~~~~

    // Specifies refinement level for cells in relation to a surface. One of
    // three modes
    // - distance. 'levels' specifies per distance to the surface the
    //   wanted refinement level. The distances need to be specified in
    //   descending order.
    // - inside. 'levels' is only one entry and only the level is used. All
    //   cells inside the surface get refined up to the level. The surface
    //   needs to be closed for this to be possible.
    // - outside. Same but cells outside.

    refinementRegions
    {
/*          refineBox
        {
            mode inside;
            levels ((1.0 1)); // first value ignored since we're not using distance selection but still needed
        }  */
    }


    // Mesh selection
    // ~~~~~~~~~~~~~~


    locationInMesh (0 0.5 0.5);

    //locationsOutsideMesh ((1 0 1.3));

    allowFreeStandingZoneFaces false;

    // Enable automatic leak closure (default is exit immediately)
    useLeakClosure false;
}

// Settings for the snapping.
snapControls
{
    nSmoothPatch 5;

    tolerance 2.0;
   
    nSolveIter 30;

    nRelaxIter 5;

    // Feature snapping

        nFeatureSnapIter 15;

        implicitFeatureSnap false;

        explicitFeatureSnap true;

        multiRegionFeatureSnap false;
}



// Settings for the layer addition.
addLayersControls
{
    relativeSizes true;
    minThickness 0.001e-6;
    //firstLayerThickness 0.15e-4;
    finalLayerThickness     0.5;
    expansionRatio 1.3;

    // Per final patch (so not geometry!) the layer information
    layers
    {
        sphere
        {
            nSurfaceLayers 5;
        }
    }

    nGrow 0;

    // Advanced settings

    featureAngle 60;

    slipFeatureAngle 30;

    nSmoothSurfaceNormals 1;

    nSmoothNormals 3;

    nSmoothThickness 10;

    maxFaceThicknessRatio 0.5;

    maxThicknessToMedialRatio 0.3;

    minMedialAxisAngle 90;

    nBufferCellsNoExtrude 0;

    nLayerIter 50;

    nRelaxIter 20;
}



// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    #include "meshQualityDict"


    // Advanced

    //- Number of error distribution iterations
    nSmoothScale 4;
    //- Amount to scale back displacement at error points
    errorReduction 0.75;
}


// Advanced

// Format to use for lines (e.g. leak path)

// setFormat ensight;


// Write flags
writeFlags
(
    scalarLevels
    layerSets
    layerFields     // write volScalarField for layer coverage
);


// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1e-6;


// ************************************************************************* //
